In [31]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.preprocessing import LabelEncoder, OneHotEncoder

In [32]:
df = pd.read_csv('credit_data_Two-wheeler loan.csv')
df.shape

(279856, 15)

In [33]:
df.head()

,Age,Gender,Income,Credit Score,Credit History Length,Number of Existing Loans,Loan Amount,Loan Tenure,Existing Customer,State,City,LTV Ratio,Employment Profile,Profile Score,Occupation
0,31,Male,36000,604,487,5,109373,221,No,Karnataka,Mysuru,90.943430,Salaried,77,Doctor
1,25,Male,50000,447,386,2,150000,89,No,Karnataka,Bengaluru,91.135253,Salaried,43,Software Engineer
2,62,Other,178000,850,503,10,69099,110,Yes,Uttar Pradesh,Kanpur,40.000000,Salaried,90,Banker
3,69,Female,46000,668,349,6,150000,148,Yes,Karnataka,Bengaluru,87.393365,Self-Employed,86,Contractor
4,52,Male,132000,601,553,5,150000,157,No,Karnataka,Mysuru,66.158757,Salaried,90,Teacher

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 279856 entries, 0 to 279855
Data columns (total 15 columns):
 #   Column                    Non-Null Count   Dtype
---  ------                    --------------   -----
 0   Age                       279856 non-null  int64
 1   Gender                    279856 non-null  object
 2   Income                    279856 non-null  int64
 3   Credit Score              279856 non-null  int64
 4   Credit History Length     279856 non-null  int64
 5   Number of Existing Loans  279856 non-null  int64
 6   Loan Amount               279856 non-null  int64
 7   Loan Tenure               279856 non-null  int64
 8   Existing Customer         279856 non-null  object
 9   State                     279856 non-null  object
 10  City                      279856 non-null  object
 11  LTV Ratio                 279856 non-null  float64
 12  Employment Profile        279856 non-null  object
 13  Profile Score             279856 non-null  int64
 14  Occupation                261584 non-null  object
dtypes: float64(1), int64(8), object(6)
memory usage: 32.0+ MB

In [35]:
df1 = df.copy()

In [36]:
cat_features = df1.select_dtypes(include='object')
cat_features

,Gender,Existing Customer,State,City,Employment Profile,Occupation
0,Male,No,Karnataka,Mysuru,Salaried,Doctor
1,Male,No,Karnataka,Bengaluru,Salaried,Software Engineer
2,Other,Yes,Uttar Pradesh,Kanpur,Salaried,Banker
3,Female,Yes,Karnataka,Bengaluru,Self-Employed,Contractor
4,Male,No,Karnataka,Mysuru,Salaried,Teacher
...,...,...,...,...,...,...
279851,Male,No,Tamil Nadu,Chennai,Salaried,Software Engineer
279852,Female,Yes,Karnataka,Bengaluru,Salaried,Civil Servant
279853,Female,No,Karnataka,Mysuru,Unemployed,NaN
279854,Male,No,Delhi,New Delhi,Salaried,Software Engineer
279855,Other,No,Uttar Pradesh,Kanpur,Salaried,Software Engineer

In [37]:
num_features = df1.select_dtypes(exclude='object')
num_features

,Age,Income,Credit Score,Credit History Length,Number of Existing Loans,Loan Amount,Loan Tenure,LTV Ratio,Profile Score
0,31,36000,604,487,5,109373,221,90.943430,77
1,25,50000,447,386,2,150000,89,91.135253,43
2,62,178000,850,503,10,69099,110,40.000000,90
3,69,46000,668,349,6,150000,148,87.393365,86
4,52,132000,601,553,5,150000,157,66.158757,90
...,...,...,...,...,...,...,...,...,...
279851,69,61000,495,565,3,150000,14,90.300189,71
279852,45,124000,850,476,10,80341,86,78.960607,91
279853,33,71000,582,560,5,39851,101,95.000000,57
279854,67,191000,411,481,2,150000,111,56.109002,69
279855,33,18000,474,374,3,51522,75,95.000000,59

In [38]:
df1.columns

Index(['Age', 'Gender', 'Income', 'Credit Score', 'Credit History Length',
       'Number of Existing Loans', 'Loan Amount', 'Loan Tenure',
       'Existing Customer', 'State', 'City', 'LTV Ratio', 'Employment Profile',
       'Profile Score', 'Occupation'],
      dtype='object')

In [39]:
df1[cat_features.columns].nunique()

Gender                 3
Existing Customer      2
State                 10
City                  23
Employment Profile     5
Occupation            14
dtype: int64

In [40]:
df1.isnull().sum()

Age                             0
Gender                          0
Income                          0
Credit Score                    0
Credit History Length           0
Number of Existing Loans        0
Loan Amount                     0
Loan Tenure                     0
Existing Customer               0
State                           0
City                            0
LTV Ratio                       0
Employment Profile              0
Profile Score                   0
Occupation                  18272
dtype: int64

In [41]:
df1.drop(['Occupation'], axis =1,inplace = True)
df1.head()

,Age,Gender,Income,Credit Score,Credit History Length,Number of Existing Loans,Loan Amount,Loan Tenure,Existing Customer,State,City,LTV Ratio,Employment Profile,Profile Score
0,31,Male,36000,604,487,5,109373,221,No,Karnataka,Mysuru,90.943430,Salaried,77
1,25,Male,50000,447,386,2,150000,89,No,Karnataka,Bengaluru,91.135253,Salaried,43
2,62,Other,178000,850,503,10,69099,110,Yes,Uttar Pradesh,Kanpur,40.000000,Salaried,90
3,69,Female,46000,668,349,6,150000,148,Yes,Karnataka,Bengaluru,87.393365,Self-Employed,86
4,52,Male,132000,601,553,5,150000,157,No,Karnataka,Mysuru,66.158757,Salaried,90

In [44]:
cat_features = df1.select_dtypes(include = 'object')

In [46]:
cat_features.head()

   Gender Existing Customer          State       City Employment Profile
0    Male                No      Karnataka     Mysuru           Salaried
1    Male                No      Karnataka  Bengaluru           Salaried
2   Other               Yes  Uttar Pradesh     Kanpur           Salaried
3  Female               Yes      Karnataka  Bengaluru      Self-Employed
4    Male                No      Karnataka     Mysuru           Salaried

In [48]:
cat_features.nunique()

Gender                 3
Existing Customer      2
State                 10
City                  23
Employment Profile     5
dtype: int64

In [ ]:
cat_features.loc['Gender']